age = 35 # Определение числовой констаны, без кавычек
name = 'Дмитрий' # Определение символьной констаны с кавычками!
names = 'Дмитрия' # Определение символьной констаны с кавычками!
print('Привет, мир и {0}! Возраст {1} - {2} лет.'.format(name,names,age))
print('Привет, мир и {}! Возраст {} - {} лет.'.format(name,names,age))
print('Почему {} Интересуется Python?' .format(names))
print('_')
print('{0:.3}'.format(1/3)) # Вывести десятичное число (.) с точностью в 3 знака для плавающих
print('{0:_^13}'.format('(@ )WoW( @)')) # Заполнить подчеркиванием с центровкой, длина 25, слова wow
#print("Today is: {0:%a %b %d %H:%M:%S %Y}".format(datetime.now())) # Не нашлась функция datetime
print('# =================================================================================================')
i = 5; print(i)
i = i + 1; print(i)
s = '''0. Это многострочная строка.\
 1. Это вторая строка\
 2. Это третья строка... '''; print(s) # Символ косой черты '\' объединяет в одну физическую строку последующую строку
print('# =================================================================================================')
length = 5
width = 2
area = length * width
print ('Площадь равно:', area)
print ('Периметр равен:', 2 * (length + width))
print('# =================================================================================================')
